#!/usr/bin/env python3
# -*- coding: utf-8 -*-


# 人工データ数
n_data = 2000

# 訓練データの割合
rate_train = 0.8

# 説明変数の標準化有無
normalize_X = False
#normalize_X = True

# 目的変数の標準化有無
normalize_Y = False
#normalize_Y = True

# 説明変数
#name_dependent = ['X2','X3','X4','X5']
#name_dependent = ['X6','X7']
name_dependent = ['X2','X3','X4','X5','X6','X7']

# 目的変数
name_response = ['X8']

# 線形モデルパラメータ
intercept = {
            'X1':0,
            'X2':0,
            'X3':0,
            'X4':0,
            'X5':0,
            'X6':0,
            'X7':0,
            'X8':0
            }

linear_coef = {
                'X1':[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                'X2':[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                'X3':[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                'X4':[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                'X5':[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                'X6':[0.0, 1.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0],
                'X7':[0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, 0.0],
                'X8':[0.0, 0.0, 0.0, 0.0, 0.0, 1.0, 1.0, 0.0],
                }

#linear_coef = {
#                'X1':[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
#                'X2':[3.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
#                'X3':[0.0, 3.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
#                'X4':[0.0, 0.1, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0],
#                'X5':[0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0],
#                'X6':[0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0, 0.0],
#                'X7':[0.0, 0.0, 0.0, 1.0, 1.0, 0.0, 0.0, 0.0],
#                'X8':[0.0, 0.0, 0.0, 1.0, 0.0, 0.0, 0.0, 0.0],
#                }


gauss_std = {
            'X1':1,
            'X2':1,
            'X3':1,
            'X4':1,
            'X5':1,
            'X6':1,
            'X7':1,
            'X8':1
            }


## 機械学習パラメータ
# 線形回帰
param_lm = {}

# リッジ回帰
#param_ridge = {'alpha':0.1}
param_ridge = None

# lasso
param_lasso = {'alpha':0.05}

# SVR
param_svr = {'C':0.1, 
             'epsilon':0.1, 
             'kernel':'linear', 
             'gamma':'auto',      # for 'rbf', 'poly' and 'sigmoid'
             'degree':3,          # for 'poly'
             'coef0':0.0,         # for 'poly' and 'sigmoid'
             }
